# 문제 1

## 분류 예측 문제

### 성능이 우수한 예측모형을 구축하기 위해서는 적절한 데이터 전처리, 피쳐엔지니어링, 분류 알고리즘 사용, 초매개변수 최적화, 모형 앙상블 등이 수반되어야 한다.

### 수험번호.csv 파일이 만들어지도록 코드를 제출한다.

### 제출한 모형의 성능은 ROC-AUC 평가지표에 따라 채점한다.

### predict_proba로 예측, 종속변수 survived열의 범주1 확률을 예측

####

#### 데이터 파일 읽기 예제

In [6]:
import seaborn as sns
import pandas as pd
from sklearn.model_selection import train_test_split

In [7]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
X_train, X_test, y_train, y_test = train_test_split(df,df['survived'],test_size = 0.2, random_state = 42, stratify = df['survived'])
X_train = X_train.drop(['alive','survived'],axis = 1)
X_test = X_test.drop(['alive','survived'], axis = 1)
X_train.head()

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alone
692,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,True
481,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,True
527,1,male,NaN,0,0,221.7792,S,First,man,True,C,Southampton,True
855,3,female,18.0,0,1,9.3500,S,Third,woman,False,NaN,Southampton,False
801,2,female,31.0,1,1,26.2500,S,Second,woman,False,NaN,Southampton,False

####

### 1. 결측치 입력

In [10]:
X_train.isna().sum() # 결측치 확인

pclass           0
sex              0
age            137
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           553
embark_town      2
alone            0
dtype: int64

In [13]:
print('deck',X_train['deck'].value_counts(),'\n')
print('embarked',X_train['embarked'].value_counts(),'\n')
print('embark_town',X_train['embark_town'].value_counts(),'\n')

deck C    41
B    34
E    29
D    26
A    14
F    11
G     4
Name: deck, dtype: int64

embarked S    516
C    139
Q     55
Name: embarked, dtype: int64

embark_town Southampton    516
Cherbourg      139
Queenstown      55
Name: embark_town, dtype: int64

In [14]:
missing = ['age']
for i in missing:
    X_train[i] = X_train[i].fillna(X_train[i].mean())
    X_test[i] = X_test[i].fillna(X_test[i].mean())

In [15]:
X_train['deck'] = X_train['deck'].fillna('C')
X_test['deck'] = X_test['deck'].fillna('C')

X_train['embarked'] = X_train['embarked'].fillna('S')
X_test['embarked'] = X_test['embarked'].fillna('S')

X_train['embark_town'] = X_train['embark_town'].fillna('Southampton')
X_test['embark_town'] = X_test['embark_town'].fillna('Southampton')

In [17]:
X_train.isna().sum()

pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alone          0
dtype: int64

####

### 2. 라벨 인코딩

In [18]:
from sklearn.preprocessing import LabelEncoder